In [82]:
import warnings
warnings.filterwarnings('ignore')
import pandas as pd
import random

# Reading Data

In [113]:
main_data = pd.read_csv(r'I:\Python\dataSet\ml\cars\bmw.csv')
data = main_data.copy()
data.head(5)

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize
0,5 Series,2014,11200,Automatic,67068,Diesel,125,57.6,2.0
1,6 Series,2018,27000,Automatic,14827,Petrol,145,42.8,2.0
2,5 Series,2016,16000,Automatic,62794,Diesel,160,51.4,3.0
3,1 Series,2017,12750,Automatic,26676,Diesel,145,72.4,1.5
4,7 Series,2014,14500,Automatic,39554,Diesel,160,50.4,3.0

# Simple Random Sampling

In [156]:
simple_random_sampling = data.sample(frac=0.5, random_state=2024)
simple_random_sampling.head(5)

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize
7801,5 Series,2019,30850,Automatic,6000,Diesel,145,62.8,2.0
72,2 Series,2017,10900,Manual,62021,Diesel,145,65.7,2.0
8916,2 Series,2017,16350,Automatic,13750,Diesel,145,62.8,2.0
10059,X1,2017,19490,Automatic,27988,Diesel,145,57.6,2.0
3277,i3,2016,16482,Automatic,43695,Hybrid,0,470.8,0.0

# Stratified Random Sample

In [157]:
stratified_random_sample = data.groupby('model').sample(frac=0.5, random_state=2024)
stratified_random_sample.head(5)

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize
9413,1 Series,2015,13500,Automatic,82876,Petrol,235,37.7,3.0
10682,1 Series,2016,13450,Manual,33043,Diesel,30,62.8,2.0
8607,1 Series,2016,13300,Automatic,32404,Petrol,30,55.5,1.5
8897,1 Series,2014,10395,Manual,25000,Diesel,0,74.3,1.6
9922,1 Series,2013,15300,Manual,39872,Petrol,300,33.2,3.0

# Clustring

In [158]:
random.seed(2024)
data['model'] = data['model'].astype('category')
country_data = list(data['model'].unique())
data_group = random.sample(country_data, k=18)
data_clustering = data[data['model'].isin(data_group)]
# data_clustering['model'] = data_clustering['model'].cat.remove_unused_categories()
data_cluster_sample = data_clustering.groupby('model').sample(frac=0.5)
data_cluster_sample.head(5)

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize
4344,2 Series,2015,19140,Semi-Auto,12117,Petrol,260,35.8,3.0
440,2 Series,2016,16450,Semi-Auto,10250,Diesel,30,62.8,2.0
5527,2 Series,2019,22995,Manual,999,Petrol,145,42.2,1.5
600,2 Series,2016,15498,Semi-Auto,14313,Petrol,125,51.4,1.5
10170,2 Series,2017,14600,Automatic,24170,Petrol,145,53.3,1.5

# Shaping

In [159]:
data_cluster_sample.shape

(3736, 9)

In [160]:
stratified_random_sample.shape

(5392, 9)

In [161]:
simple_random_sampling.shape

(5390, 9)

# All types

In [177]:
d = data.groupby('transmission')['price'].mean()
d.reset_index()

  transmission         price
0    Automatic  22419.023969
1       Manual  14637.451128
2    Semi-Auto  27359.747964

In [178]:
srs = simple_random_sampling.groupby('transmission')['price'].mean()
srs.reset_index()

  transmission         price
0    Automatic  22566.312152
1       Manual  14549.036683
2    Semi-Auto  27580.716482

In [179]:
strs = stratified_random_sample.groupby('transmission')['price'].mean()
strs.reset_index()

  transmission         price
0    Automatic  22432.542363
1       Manual  14503.561151
2    Semi-Auto  27197.408607

In [180]:
cs = data_cluster_sample.groupby('transmission')['price'].mean()
cs.reset_index()

  transmission         price
0    Automatic  23607.187874
1       Manual  15737.355588
2    Semi-Auto  28347.032729